# Tap
tap 'homebrew/versions'

# Services
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'cmake'
brew 'curl'
brew 'findutils'
brew 'git'
brew 'grep'
brew 'libssh'
brew 'moreutils'
brew 'srcclr'
brew 'wget'

# Vim
brew 'neovim'
brew 'the_silver_searcher'
brew 'tree'
brew 'vim', args: ['override-system-vi']

# Database
brew 'mongodb'
brew 'mysql'
brew 'postgresql'
brew 'sqlite'

# Languages
brew 'elixir'
brew 'go'
brew 'libxml2'
brew 'libyaml'
brew 'lua'
brew 'node'
brew 'perl'
brew 'php70'
brew 'python'
brew 'ruby'
brew 'rust'

# Managers
brew 'composer'
brew 'rbenv'
brew 'yarn'

# Compilers
brew 'dfu-util'
brew 'libsass'

# Development
brew 'phantomjs'
brew 'php-code-sniffer'
brew 'redis'
brew 'tmate'
brew 'tmux'

# Image
brew 'graphicsmagick'
brew 'imagemagick'
brew 'jpeg'
brew 'libpng'
brew 'librsvg'
brew 'libtiff'

# Information
brew 'archey'
brew 'git-standup'
brew 'shared-mime-info'

# Else
brew 'autoconf'
brew 'fontconfig'
brew 'gemnasium-toolbelt'
brew 'gettext'
brew 'glib'
brew 'gnupg'
brew 'icu4c'
brew 'libevent'
brew 'libffi'
brew 'libtermkey'
brew 'libusb'
brew 'msgpack'
brew 'openssl'
brew 'readline'
brew 'ssh-copy-id'
brew 'utf8proc'
brew 'xz'
