# Tap
tap "homebrew/versions"
tap "homebrew/homebrew-php"
tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "buo/cask-upgrade"
tap "neovim/neovim"

# Services
brew "automake"
brew "bash"
brew "bash-completion"
brew "cask"
brew "cmake"
brew "curl"
brew "findutils"
brew "git"
brew "git-extras"
brew "grep"
brew "libgcrypt"
brew "libssh"
brew "libssh2"
brew "moreutils"
brew "wget"

# Vim
brew "neovim"
brew "the_silver_searcher"
brew "tree"
brew "vim", args: ["override-system-vi"]

# Database
brew "flyway"
brew "mongodb"
brew "mysql"
brew "postgresql"
brew "sqlite"

# Languages
brew "elixir"
brew "erlang"
brew "go"
brew "libxml2"
brew "libyaml"
brew "lua"
brew "node"
brew "perl"
brew "php"
brew "python"
brew "ruby"
brew "rust"

# Managers
brew "composer"
brew "nvm"
brew "rbenv"
brew "yarn"

# Compilers
brew "dfu-util"
brew "libsass"

# Development
brew "editorconfig"
brew "geckodriver"
brew "phantomjs"
brew "php-code-sniffer"
brew "php70-xdebug"
brew "redis"
brew "tmate"
brew "tmux"

# Image
brew "graphicsmagick"
brew "imagemagick"
brew "jpeg"
brew "libpng"
brew "librsvg"
brew "libtiff"

# Information
brew "archey"
brew "git-standup"
brew "shared-mime-info"

# Else
brew "autoconf"
brew "fontconfig"
brew "gettext"
brew "glib"
brew "gnupg"
brew "icu4c"
brew "libevent"
brew "libffi"
brew "libtermkey"
brew "libusb"
brew "msgpack"
brew "openssl"
brew "qt"
brew "readline"
brew "ssh-copy-id"
brew "utf8proc"
brew "xz"
