# Tap
tap 'homebrew/cask-fonts'
tap 'heroku/brew'

# Shell
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Services
brew 'git'
brew 'svn'

# Database
brew 'sqlite'

# Languages
brew 'elixir'
brew 'erlang'
brew 'go'
brew 'node'
brew 'ruby'

# Managers
brew 'nvm'
brew 'rbenv'
brew 'yarn'

# Compilers
brew 'dfu-util'

# Development
brew 'geckodriver'

# Image
brew 'imagemagick'

# Utilities
brew 'heroku'
brew 'readline'
