brew 'mas'

# Programming languages
brew 'elixir'
brew 'erlang'
brew 'go'
brew 'node'
brew 'python'
brew 'ruby'

# Dependencies for programming languages
brew 'openssl'
brew 'readline'

# CLI Tools
brew 'git'
brew 'wget'

# Database
brew 'postgresql'
brew 'sqlite'

# Version managers and compilers
brew 'rbenv'
brew 'ruby-build'
brew 'nvm'
brew 'yarn'

# Devedlopment tools
brew 'redis'

# Shell
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Other tools
brew 'cmake'
brew 'dfu-util'
brew 'imagemagick'
brew 'vips'
